/* eslint-disable */
<template>
  <div id="Guide">
      <div class="guide_content">
        <ul>
          <li>• UNDT全球网关支付系统是什么？</li>
          <li class="guide_ans">UNDT全球网关支付系统是由UnionDao社区开发者发布的一个基于以太坊网络的去中心化金融应用工具，方便全球UNDT用户使用UNDT与全球货币便利流通。</li>
          <li>• UNDT全球网关支付系统能做什么？</li>
          <li class="guide_ans">作为用户，将UNDT在此交易平台出售，可提现相应地区的法定货币。作为服务方，接收UNDT，支付相应地区的法币给用户，从而收取服务费获利。</li>
          <li>• 使用前准备</li>
          <li class="guide_ans">以太坊钱包，钱包中备有UNDT，ETH。UNDT用于交易支付，ETH用于支付
            网络矿工费。<br>
            手机端：imToken、Trust等以太坊手机钱包；<br>
            WEB端：MetaMask钱包；<br>
            钱包安装路径：访问各钱包官网，参考如下：<br>
            <a href="./index"><u>imToken</u></a> &nbsp&nbsp&nbsp&nbsp
            <a href="./index"><u> Trust Wallet</u></a>&nbsp&nbsp&nbsp&nbsp
            <a href="http://www.baidu.com"><u> METAMASK</u></a>
            </li>
          <li>• 如何发起支付？</li>
          <li class="guide_ans">支付流程：手机钱包内浏览器打开und.cash支付系统—合约授权—选择网关—
            输入支付金额—填写附言—发起支付—确认支付信息—授权支付UNDT—完成
            支付提交 <br>
            1. 打开手机钱包imToken、Trust等以太坊钱包，用钱包浏览器访问und.cash
            全球网关支付系统；<br>
            2. 合约授权，解锁授权合约访问权限；<br>
            3. 添加设置支付网关，保存收款信息；<br>
            4. 选择网关，根据参考汇率输入需要兑换的金额，发布订单。
          </li>
          <li>• 注意事项：</li>
          <li class="guide_ans">1. 设置网关时必须要保存公钥，用于对支付信息的加密和解密匹配，否则支付信息无法正常提交；；<br>
            2. 合约交易每一步操作都需要有成功授权，否则支付请求无法正常提交。<br>
            3. 正确收到款项后需即时确认收款，超时确认会罚扣保证金（支付金额的1%）。
          </li>
          <li>• 合约交互异常</li>
          <li class="guide_ans">
            1.	检查网络连接情况。<br>
            2.	合约交互过慢可以考虑提高矿工费以加速。<br>
            3.	如果合约交互成功，页面的状态却迟迟没有刷新，请尝试手动刷新。<br>
            4.	在个别情况下可能会出现您下单的同时买家恰好刚关闭服务，<br>
            这将导致合约交互直接失败，这属于不可控力，为您带来的不便还请谅解。
          </li>
          <li>• 如何添加网关信息？</li>
          <li class="guide_ans">
            在发起支付前先添加支付网关信息，网关信息也就是收款方信息，包含内容：国家/地区、币种、银行名称、收款方户名、
            收款方帐号。提交的网关信息是加密传输，仅限买卖双方可见。
            注意事项：<br>
            1.设置网关时必须要上传保存公钥，用于对支付信息的加密和解密匹配，否则支付信息无法正常提交；<br>
            2.网关信息直接影响能否收到款，请一定要确定所提交收款信息的正确性。
          </li>
          <li>• 如何取消交易？</li>
          <li class="guide_ans">
            发起支付交易后，交易记录列表可以看到订单的状态。当订单状态显示【等待接单】时，表示买家还没有接单，这种状态下可以取消交易；否则表示买家已经在处理支付，无法再进行交易取消。
          </li>
          <li>• 如何确认收款？</li>
          <li class="guide_ans">
            发起支付交易后，交易记录列表可以看到订单的状态。当订单状态显示【确认收款】时，表示买家已经按照收款信息付款给了收款人。请确认支付发起时所提交的收款帐户是否已正确收到款项，已收到请点击【确认收款】授权发币给买家；未收到请点击【申诉】，发起订单申诉提醒买家再次付款。成功收到款后点击【确认收款】授权发币给买家。
          </li>
          <li>• 如何发起申诉？</li>
          <li class="guide_ans">
            支付交易发起后1小时，买家没有完成接单，可以点击【申诉】发起申诉，发起申诉后在【查看】订单详情页可以与对方留言沟通，沟通内容是加密后在链上传输，只有沟通双方可以解密查看。
          </li>
          <li>• 如何发起投诉？</li>
          <li class="guide_ans">
            交易完成后，若发生款项回撤或者其它资金异常问题，可对订单发起投诉，提醒买家处理。在【查看】订单情页发起投诉【沟通】留言给对方，沟通内容是加密后在链上传输，只有沟通双方可以解密查看。
          </li>
          <li>• 如何成为合格可接单服务商？</li>
          <li class="guide_ans">
            手机钱包内浏览器打开https://und.cash/myMobile.html全球网关支付系统商户端，点【申请成为商户】进入到商户系统。<br>
            第一步，点击帐户后面的【解锁】按钮，完成合约授权；<br>
            第二步，缴纳保证金，点击【增加保证金】，输入保证金额，提交并授权支付；<br>
            第三步，设置网关参数，点击【添加支付网关】，完成网关参数配置；<br>
            第四步，打开网关，保持在线状态。
          </li>
          <li>• 服务商保证金是什么？</li>
          <li class="guide_ans">
            服务商保证金是为了保障订单高效率完成，同时也是系统匹配推送订单的重要依据。<br>
            1.	保证金的多少直接决定服务商可接收到的订单的金额，单笔订单可受理最大金额是保证金的0.5倍，累计在线订单金额是保证金的5倍。<br>
            2.	在发生交易处理超时的情况下，每次超时会按次罚扣保证金补偿给交易方。
          </li>
          <li>• 服务商支付网关如何设置？</li>
          <li class="guide_ans">
            在服务商帐户管理页面，点击【添加支付网关】打开网关设置页，首先上传公钥，然后选择一个支付网关，设置相应参数。
            各参数的解读如下：<br>
            价格，对手商品兑UNDT的买入价格；<br>
            数量，计划买入商品的数量；<br>
            最小额，单笔可买入的最小额；<br>
            最大额，单笔可买入的最大额；<br>
            手续费，每笔交易要收取的手续费，建议为0。
          </li>
          <li>• 服务商如何进行订单管理？</li>
          <li class="guide_ans">
            商户在我的帐户左上角点击【开始接单】，进入订单管理；订单管理根据订单状态分类订单，订单状态分为：待接单、待付款、申诉中、投诉中、已完成。<br>
            1、接单 <br>
            系统根据网关参数匹配后推送符合接单要求的订单。<br>
            点击【查看订单】，打开订单详情页，查看审核收款信息是否符合；<br>
            点击【接单】授权钱包发起交易，区块链确认后完成锁单，订单进入付款状态；<br>
            点击【退单】，订单所属UNDT退回卖方帐户，交易取消。<br>
            2、付款 <br>
            订单接单后，进入待付款状态。<br>
            点击【查看订单】，打开订单详情页，查看收款信息，操作付款；<br>
            点击【付款】进入付款操作，输入付款凭证ID/交易HASH，点击【提交】，完成付款操作；<br>
            点击【取消交易】，输入取消理由，【提交】后，订单所属UNDT返回卖方帐户，交易取消。<br>
            3、处理申诉 <br>
            接到卖方申诉时，订单会显示在申诉列表中。<br>
            点击【沟通】，可以看到对方的留言信息，进行申诉回应；沟通内容是加密后在链上传输，只有沟通双方可以解密查看。
            如核实收款帐户问题，可以通过【沟通】联系对方核实收款信息，再次付款；也可直接【取消交易】。<br>

            4、处理投诉 <br>
            接到卖方投诉时，订单会显示在投诉列表中。<br>
            点击【沟通】，可以看到对方的留言信息，进行申诉回应。沟通内容是加密后在链上传输，只有沟通双方可以解密查看。核查确认为付款不成功可点【退币】，将该订单UNDT退回卖方帐户，订单完成交易。<br>

            5、订单被申诉如何仲裁？<br>
            交易发生申诉时，系统会启动仲裁机制。根据双方提供的交易凭证及相关材料系统做出退币给卖方或付币给买方。若是买方违约，系统判退币给卖方，并罚扣买方对应交易金额1%的保证金；反之则判付币给买方，罚扣卖方对应交易金额1%的保证金。<br>

            6、订单被投诉如何仲裁？<br>
            交易发生投诉时，系统会启动仲裁机制。根据双方提供的交易凭证及相关材料系统退币给卖方或直接关闭投诉。如果是买方违约，系统判退币给卖方，系统给此次投诉记录为买方败诉，败诉次数直接影响买家信誉；否则直接关闭投诉。
          </li>
        </ul>
      </div>
  </div>
</template>
<script>
/* eslint-disable */
export default {
  name:'Guide',
}

</script>

<style lang="scss" scoped>
#Guide{
  .guide_content{
      width: 600px;
      height: 830px;
      position:fixed;
      top:0;
      bottom: 0;
      left:0;
      right: 0;
      margin: calc(21% + 80px) auto;
      z-index:2;
      overflow-y: auto;
      -webkit-overflow-scrolling: touch !important;
      ul{
        height: 100%;
        width: 100%;
        padding-top: 10px;
        padding-right: 10px;
        box-sizing: border-box;
        li{
          font-size: 20px;
          color:#666666;
          width: 100%;
          min-height: 25px;
          line-height: 26px;
          margin-bottom: 5px;
          letter-spacing: 1px;
          u{
            display: inline-block;
            font-size: 18px;
            margin-top: 3px;
            color: #319B38;
            // text-decoration: ;
          }
        }
        .guide_ans{
          padding-left: 12px;
          box-sizing: border-box;
          margin-bottom: 20px;
          font-size: 18px
        }

      }
    }
  }

</style>
